Repository: samuel0072/academic-calendar-api
Catalog: src/AcademicCalendarAPI/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Could not find the start date column
pt_br: Não foi possível encontrar a coluna de data de início

source: Could not find the description column
pt_br: Não foi possível encontrar a coluna de descrição

source: Could not find the duration column
pt_br: Não foi possível encontrar a coluna de duração

source: Could not find the period column
pt_br: Não foi possível encontrar a coluna de espaço

source: Could not find the end date column
pt_br: Não foi possível contrar a coluna de data de fim

source: Could not import row %(row_index)s. The start_date_column value must not be empty when the previous row's period_column value is empty
pt_br: Nao foi possívlel importar a linha %(row_index)s. O valor da coluna de data de início não pode ser vazio quando o valor da coluna de espaço da linha anterior é vazio

source: Could not import row %(row_index)s. The end_date_column value must not be empty when the row's duration_column value is empty
pt_br: Não pode importar a linha %(row_index)s. O valor da coluna de data de fim não pode ser vazio quando o valor da coluna de duração está vazio

source: Could not find the date column
pt_br: Não foi possível encontrar a coluna de data

source: Could not find the name column
pt_br: Não foi possível encontrar a coluna de nome

source: National holiday
pt_br: Feríado nacional

source: Regional holiday
pt_br: Feríado local

source: Non-school days
pt_br: Dias não-letivos

source: School days
pt_br: Dias letivos

source: User
pt_br: Usuário

source: End date has to be after start date
pt_br: A data de fim deve ser após a data de início

source: Color has to be a number in a hexadecimal format
pt_br: A cor deve ser um número no formato hexadecimal

source: An empty description is not valid
pt_br: Uma descrição vazia não é válida

source: A campus must be provided for this event
pt_br: Um campus deve ser fornecido para esse evento

source: This start date isn't a saturday
pt_br: A data de início não é um sábado

source: You don't have permission to create events on this calendar
pt_br: Você não tem permissão para criar eventos nesse calendário.

source: Could not find the academic calendar.
pt_br: Não foi possível encontrar o calendário acadêmico.

source: You don't have permission to create events on this campus: %(name)s
pt_br: Você não tem permissão para criar eventos nesse campus: %(name)s

source: Lessons end date has to be after lessons start date
pt_br: A data de fim das aulas deve ser após a data de início das aulas

source: Lessons start date has to be between semester's start date and end date
pt_br: A data de início das aulas deve estar entre a data de início e fim do semestre

source: Lessons end date has to be between semester's start date and end date
pt_br: A data de fim das aulas deve estar entre a data de início e fim do semestre

source: You don't have permission to create semesters on this calendar
pt_br: Você não tem permissão para criar semestres nesse calendário

source: A semester can't start or end during another semester
pt_br: Um semestre não pode iniciar ou terminar durante outro semestre

source: The passed id is not valid
pt_br: O id informado não é válido.

source: An unexpected error ocurred.
pt_br: Um erro inexperado aconteceu.

source: Could not retrieve the especified file. It may be deleted.
pt_br: Não pode obter o arquivo especificado. Ele pode ter sido apagado.

source: Could not find the file.
pt_br: Não foi possível encontrar o arquivo.

source: Could not find the campus.
pt_br: Não foi possível encontrar o campus.

source: This campus has events associated. You should desaasiate those events before deleting this campus.
pt_br: Esse campus tem eventos associados. Você deve desassociar esses eventos antes de deletar esse campus.

source: campi is required
pt_br: campi é obrigatório

source: campi should be an array of campus's ids
pt_br: campi deve ser um array de ids de campus

source: No file were provided.
pt_br: Nenhum arquivo foi fornecido.

source: The 'file' parameter is required.
pt_br: O paramêtro 'file' é obrigatório.

source: You should provide one file at a time
pt_br: Você deve fornecer 1 arquivo por vez

source: You should provide at least 1 campus from your organization.
pt_br: Você deve fornecer pelo menos 1 campus de sua organização

source: campi should be a valid json list
pt_br: campi deve ser uma lista json de formato válido

source: This file could not be imported. Verify whether the file format is .xlsx or the data is structured in a date, name format.
pt_br: Não foi possível importar o arquivo. Verifique se o arquivo está no formato .xlsx ou se os dados estão estruturados num formato de colunas data, nome.

source: This file could not be imported. Verify if the file format is .xlsx.
pt_br: Não foi possível importar o arquivo. Verifique se o formato do arquivo é .xlsx

source: Could not find the event.
pt_br: Não foi possível encontrar o evento

source: Could not find the semester.
pt_br: Não foi possível encontrar o semestre

source: password and confirm_password are not equal.
pt_br: Senha e confirmar senha não são iguais

source: You can't do this to your own user.
pt_br: Você não pode fazer isso ao seu próprio usuário

source: This user was not found
pt_br: O usuário não foi encontrado
